app/controllers/facilities_licenses_controller.rb

SELECT  "b3_facilities".* FROM "b3_facilities" WHERE "b3_facilities"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def index
    @b3_facility = B3Facility.find(params[:id])