app/controllers/facilities_controller.rb

  def index
    @b3facilities = B3Facility.all
---
SELECT "b3_facilities".* FROM "b3_facilities"
SELECT "facilities".* FROM "facilities"

  def create
    b3_facility = B3Facility.new({
      b3_street_number: params[:facility][:b3_street_number],
      b3_street_prefix: params[:facility][:b3_street_prefix],
      b3_street_name: params[:facility][:b3_street_name],
      b3_street_type: params[:facility][:b3_street_type],
      b3_unit_info: params[:facility][:b3_unit_info],
      b3_city: params[:facility][:b3_city],
      b3_state: params[:facility][:b3_state],
      b3_zip: params[:facility][:b3_zip],
      b3_has_co: params[:facility][:b3_has_co],
      created_at: Time.now,
      updated_at: Time.now
    })

    b3_facility.save
---
INSERT INTO "b3_facilities" ("b3_street_number", "b3_street_prefix", "b3_street_name", "b3_street_type", "b3_unit_info", "b3_city", "b3_state", "b3_zip", "b3_has_co", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11) RETURNING "id"

  def show
    @b3_facility = B3Facility.find(params[:id])
---
SELECT  "b3_facilities".* FROM "b3_facilities" WHERE "b3_facilities"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]