app/controllers/franchisees_controller.rb

  def index
    @franchisees = Franchisee.all
---
SELECT "franchisees".* FROM "franchisees"