app/controllers/licenses_controller.rb

  def show
    @b1_permit = B1Permit.find(params[:id])
    @b3_facility = B3Facility.find(@b1_permit.b3_facility_id)
---
SELECT  "b3_facilities".* FROM "b3_facilities" WHERE "b3_facilities"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]