app/controllers/licenses_controller.rb

  def index
    @b1permits = B1Permit.all
---
SELECT "b1_permits".* FROM "b1_permits"

  def create
    B1Permit.create(
      b3_facility_id: params[:id],
      b1_special_text: params[:b1permit][:b1_special_text],
      b1_appl_status: params[:b1permit][:b1_appl_status],
      b1_per_sub_type: params[:b1permit][:b1_per_sub_type],
      b1_expiration: 1.year.from_now,
      b1_extraction: params[:b1permit][:b1_extraction],
      b1_plant_count: params[:b1permit][:b1_plant_count]
    )
---
INSERT INTO "b1_permits" ("b3_facility_id", "b1_special_text", "b1_appl_status", "b1_per_sub_type", "b1_expiration", "b1_extraction", "b1_plant_count", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"